hanielgarcia/Haniel_Garcia_Micro_2026_C2/TAREA 6/sdkconfig.defaults
# ESP32-S3 Reaction Timer - sdkconfig.defaults
# Generated for ESP-IDF v5.5.4

# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# CPU Frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# WiFi
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y

# Flash
CONFIG_SPI_FLASH_SIZE_OVERRIDE=8388608
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_OFFSET=0x8000

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Optimization
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y

# mbedTLS
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=16384

# ESP Timer high resolution
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y